<?php

/**
 * @version 1.0
 */
class Blacklist {

   static public $wordsArr = array("性","艳","乳","裆","胯","奶","淫","欲望","黄色","叫床","
绳虐","精液","情欲","色欲","爱液","高潮","肛交","阴水","阴茎","
阴蒂","阴道","阴唇","射精","鸡巴","色情","烂逼","卖逼","贱逼","兽交","鸡奸","诱奸","生殖器","阳具","
操逼","法轮功","李洪志","明慧新闻","胡锦涛","江泽民","毛泽东","邓小平","习近平","共产党","中共","
台独","台湾独立","藏独","西藏独立","疆独","新疆独立","天安门屠杀","发抡功","九评","
自慰","A片","A级","三级","裸体","胴体","失身","私处","强奸","轮奸","群奸","SM","情色","
色图","色诱","一夜情","夜激情","禁片","爱液","G点","波波","肛交","裸女","3级片","三级片","
四级片","4级片","日日","我日","我操","傻逼","B","色情","骚货","日死你","日你","去你妈的","屁眼","
卖比","卖逼","烂比","烂逼","狂操","靠你妈","贱人","贱货","贱逼","奸淫","狗操","狗b","二逼","二B","
大花逼","大逼","操他","操你妈","操你","吮吸","肛","虐待","奸尸","虐猫","虐畜","兽交","鸡奸","
诱奸","乱伦","处女膜","荡妇","发骚","骚妇","骚妹","AV","女优","妓女","发浪","破处","生殖器官","
射精","受孕","淫靡","开苞","芳穴","","蜜液","小鸡鸡","JJ","花蕊","猥亵","做爱","风骚","裸戏","罩杯","
贞操","玉体","泄春光","波霸","裸体","自摸","私处","丰胸翘臀","赤裸","裸体","巨波","波波","双沟","臀沟","
酥胸","罩杯","凸点","乱伦","闷骚","胴体","酥胸","欲火","咪咪","燥热","骚妖","媚妙","波霸","色诱","色情","
骚货","呻吟","消魂夺魄","赤裸裸","裸","奸","娇喘","欲仙欲死","强暴","gay","逼样","婊子","操逼","操比","
操蛋","大b","大B","干你娘","干死你","贱比","杂种","招妓","作爱","玉体","鸦片","冰毒","吗啡","摇头丸","
注射毒品","海洛因","走私","百家乐","廿一点","鱼虾蟹骰子","骰宝赌大","骰宝赌小","富贵三公","
三公百家乐","轮盘","廿五点","联奖扑克","牌九","麻将牌九","雀九","番摊","角子机","白鸽票","
泵波拿","博彩赛狗","赛马","大法","法轮","法轮功","法轮大法","人民报","真善忍","转法轮","
自焚","一党","多党","民主","专政","民运","六四","暴动","暴乱","发抡","发伦","发伦功","发论","
发论公","发论功","法*功","法lun功","法功","法愣","法仑","法伦","法论","法十轮十功","法谪","抡功","
伦功","轮大","氵去","氵去车仑工力","人兽","2P","3P","群P","女优","肉缝","肉棒","花间","风色","推倒","勾搭");
 
   static public function getInstence($params = array()) {
   	return new WeChat ( $params );
   }
}



?>
